{
    "name": "Copshowium Creation",
    "category": "technomancy",
    "priority": true,
    "icon": "crossroads:copshowium_creation_chamber",
	"sortnum": 0,
    "pages": [
        {
            "type": "spotlight",
            "item": "crossroads:ingot_copshowium",
            "title": "Copshowium",
			"link_recipe": true,
            "text": "The basic material for Technomancy is copshowium, an orange metal that can be made into blocks, nuggets, gears, and axles. Copshowium gears have 0 mass (and 0 moment of inertia), so they won't contain any energy while spinning, and have no loss. Their speed is determined by the Rotation Ratio and the speed of other gears. "
        },
        {
            "type": "text",
            "text": "With a normal Master Axis, you can not create a gear network entirely of 0 moment of inertia gears, because there is nothing to set the speed. There are special Master Axes in Technomancy that do allow it, however (allowing for energy free networks)."
        },
        {
            "type": "spotlight",
            "item": "crossroads:copshowium_creation_chamber",
            "title": "Copshowium Creation",
            "text": "The Copshowium Creation Chamber creates molten copshowium via the transformation of fluids, which can be converted into copshowium ingots via the $(l:heat/fluid_cooling_chamber)Fluid Cooling Chamber$(). A Copshowium Creation Chamber can store 1296mB of fluid, which is equivalent to 1 block of fluid, or 9 ingots."
        },
        {
            "type": "key_text",
            "text": "Liquid can be both inserted and extracted through the top & bottom (so Fluid Tubes use the pressure system if not made one way). The first way to make copshowium is to insert #ccc_expensive_liquid# into the chamber and hit it with a $(time)time$() beam. This will turn the #ccc_expensive_liquid# into molten copshowium, with each 5mB of #ccc_expensive_liquid# into 9mB of copshowium. Overfilling the chamber (creating > 1296mB of molten copshowium) will break the chamber. "
        },
        {
            "type": "key_text",
            "text": "Mixing metals in the chamber will destroy any contained copshowium. The second way to create copshowium is the same process, but uses #ccc_field_liquid# instead of #ccc_expensive_liquid# & requires using fields (later Technomancy concept). In order to turn #ccc_field_liquid# into molten copshowium, when the time beam hits the chamber the chunk the chamber is in must be unlocked and the chunk will lose (#ccc_field_liquid# content)/9 flux, so a field management system must be designed accordingly."
        },
        {
            "type": "detailed_crafting",
            "title": "Creation Chamber",
            "recipe": "tile.copshowium_creation_chamber",
            "path": "technomancy"
        }
    ],
    "read_by_default": true,
    "advancement": "crossroads:crossroads/technomancy"
}